In [1]:
import pandas as pd

In [11]:
df1 = pd.read_csv('missing.csv',delimiter=':')
df2 = pd.read_csv('missingFound.csv',delimiter='|')

In [8]:
df1.head()

   id                                           address
0   2           Allerton/Pelham Gardens,Bronx, New York
1  14          Bay Terrace/Fort Totten,Queens, New York
2  20               Bensonhurst East,Brooklyn, New York
3  21               Bensonhurst West,Brooklyn, New York
4  22   Bloomfield/Emerson Hill,Staten Island, New York

In [9]:
df2.head()

   id                                          address                Location
0   2          Allerton/Pelham Gardens,Bronx, New York  40.8654218,-73.8545318
1  14         Bay Terrace/Fort Totten,Queens, New York  40.7920939,-73.7786745
2  20              Bensonhurst East,Brooklyn, New York  40.6146916,-74.0129784
3  21              Bensonhurst West,Brooklyn, New York  40.6146916,-74.0129784
4  22  Bloomfield/Emerson Hill,Staten Island, New York  40.6151637,-74.2592761

### Check if each value in missingFound.csv has its Location

In [12]:
missing = []
for i in range(len(df1['id'])):
    found = False
    for j in range(len(df2['id'])):
        if df1['id'][i] == df2['id'][j]:
            found = True
            break
    if not found:
        missing.append(df1['id'][i])

print(missing)

[]

### Seperating locations

In [13]:
df2.head()

   id                                          address                Location
0   2          Allerton/Pelham Gardens,Bronx, New York  40.8654218,-73.8545318
1  14         Bay Terrace/Fort Totten,Queens, New York  40.7920939,-73.7786745
2  20              Bensonhurst East,Brooklyn, New York  40.6146916,-74.0129784
3  21              Bensonhurst West,Brooklyn, New York  40.6146916,-74.0129784
4  22  Bloomfield/Emerson Hill,Staten Island, New York  40.6151637,-74.2592761

In [16]:
df2[['Lat', 'Lon']] = df2['Location'].str.split(',', expand=True)

Fixing Data-Type

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        70 non-null     int64
 1   address   70 non-null     object
 2   Location  69 non-null     object
 3   Lat       69 non-null     float64
 4   Lon       69 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.9+ KB

In [20]:
df2['Lat'] = pd.to_numeric(df2['Lat'], errors='coerce')
df2['Lon'] = pd.to_numeric(df2['Lon'], errors='coerce')

In [22]:
df2.head()

,id,address,Location,Lat,Lon
0,2,"Allerton/Pelham Gardens,Bronx, New York","40.8654218,-73.8545318",40.865422,-73.854532
1,14,"Bay Terrace/Fort Totten,Queens, New York","40.7920939,-73.7786745",40.792094,-73.778674
2,20,"Bensonhurst East,Brooklyn, New York","40.6146916,-74.0129784",40.614692,-74.012978
3,21,"Bensonhurst West,Brooklyn, New York","40.6146916,-74.0129784",40.614692,-74.012978
4,22,"Bloomfield/Emerson Hill,Staten Island, New York","40.6151637,-74.2592761",40.615164,-74.259276

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        70 non-null     int64
 1   address   70 non-null     object
 2   Location  69 non-null     object
 3   Lat       69 non-null     float64
 4   Lon       69 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.9+ KB

In [24]:
df2.drop(columns='Location')

,id,address,Lat,Lon
0,2,"Allerton/Pelham Gardens,Bronx, New York",40.865422,-73.854532
1,14,"Bay Terrace/Fort Totten,Queens, New York",40.792094,-73.778674
2,20,"Bensonhurst East,Brooklyn, New York",40.614692,-74.012978
3,21,"Bensonhurst West,Brooklyn, New York",40.614692,-74.012978
4,22,"Bloomfield/Emerson Hill,Staten Island, New York",40.615164,-74.259276
...,...,...,...,...
65,237,"Upper West Side North,Manhattan, New York",40.781824,-73.984160
66,243,"Washington Heights South,Manhattan, New York",40.853142,-73.960543
67,249,"Westchester Village/Unionport,Bronx, New York",40.835407,-73.847046
68,253,"Williamsbridge/Olinville,Bronx, New York: 40 ....",NaN,NaN
69,255,"Williamsburg (South Side),Brooklyn, New York",40.705255,-73.957305

## Fixing PickUps.csv

In [60]:
import numpy as np

In [76]:
df3 = pd.read_csv('PickUps.csv')

In [77]:

df3.head()

,LocationID,Borough,Zone,address,lat,lon
0,1,EWR,Newark Airport,"Newark Airport,EWR, New York",40.689064,-74.177255
1,2,Queens,Jamaica Bay,"Jamaica Bay,Queens, New York",40.603994,-73.835412
2,3,Bronx,Allerton/Pelham Gardens,"Allerton/Pelham Gardens,Bronx, New York",NaN,NaN
3,4,Manhattan,Alphabet City,"Alphabet City,Manhattan, New York",40.706964,-73.990459
4,5,Staten Island,Arden Heights,"Arden Heights,Staten Island, New York",40.563700,-74.191603

In [62]:
lat , lon = [i for i in df3['lat']] , [i for i in df3['lon']]

In [ ]:
df3.head()

,LocationID,Borough,Zone,address,lat,lon
0,1,EWR,Newark Airport,"Newark Airport,EWR, New York",40.689064,-74.177255
1,2,Queens,Jamaica Bay,"Jamaica Bay,Queens, New York",40.865422,-73.854532
2,3,Bronx,Allerton/Pelham Gardens,"Allerton/Pelham Gardens,Bronx, New York",NaN,NaN
3,4,Manhattan,Alphabet City,"Alphabet City,Manhattan, New York",40.706964,-73.990459
4,5,Staten Island,Arden Heights,"Arden Heights,Staten Island, New York",40.563700,-74.191603

In [70]:
print(len(lat))

298

In [75]:
df3.isna().sum()

LocationID     0
Borough        0
Zone           0
address        0
lat           38
lon           38
dtype: int64

In [79]:
missing_new = {}
for i in range(len(df3['lat'])):
    if pd.isna(df3['lat'][i]):
        missing_new[df3['LocationID'][i]] = df3['address'][i]

In [87]:
id , add = [], []
for i,j in missing_new.items():
    id.append(i)
    add.append(j)
df_new = pd.DataFrame({
    'id' : id,
    'address' : add
})
df_new.head()
df_new.to_csv('missing.csv')

In [74]:
df2 = df2.sort_values(by='id')
df2.to_csv('missingFound.csv')

In [67]:
latm , lonm = [i for i in df2['Lat']] , [i for i in df2['Lon']]

In [73]:
index = 0
for i in range(len(lat)):
    if pd.isna(lat[i]):
        index += 1
        print(i)
print(len(latm),index)

2
14
22
27
38
47
49
52
70
77
86
89
98
101
108
113
125
138
164
166
177
182
196
202
209
226
233
241
248
253
258
262
268
270
273
282
285
288
70 38

In [88]:
df2 = pd.read_csv('missing.csv')

In [90]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       59 non-null     int64
 1   address  59 non-null     object
 2   lat      59 non-null     float64
 3   lon      59 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 2.0+ KB

In [92]:
# Make sure the key columns are the same type and have no extra spaces
df3['LocationID'] = df3['LocationID'].astype(str).str.strip()
df2['id'] = df2['id'].astype(str).str.strip()

# Create mapping from id to Lat/Lon
lat_map = df2.set_index('id')['lat']
lon_map = df2.set_index('id')['lon']

# Fill missing values in df3['lat'] and df3['lon'] using the mapping
df3['lat'] = df3['lat'].combine_first(df3['LocationID'].map(lat_map))
df3['lon'] = df3['lon'].combine_first(df3['LocationID'].map(lon_map))

In [93]:
df3.head()

,LocationID,Borough,Zone,address,lat,lon
0,1,EWR,Newark Airport,"Newark Airport,EWR, New York",40.689064,-74.177255
1,2,Queens,Jamaica Bay,"Jamaica Bay,Queens, New York",40.603994,-73.835412
2,3,Bronx,Allerton/Pelham Gardens,"Allerton/Pelham Gardens,Bronx, New York",40.865422,-73.854532
3,4,Manhattan,Alphabet City,"Alphabet City,Manhattan, New York",40.706964,-73.990459
4,5,Staten Island,Arden Heights,"Arden Heights,Staten Island, New York",40.563700,-74.191603

In [94]:
df3.isna().sum()

LocationID    0
Borough       0
Zone          0
address       0
lat           0
lon           0
dtype: int64

In [95]:
df3.to_csv('PickUps.csv')

Missing Values Successfully Filled ✓✓